app/Http/Controllers/Admin/CategoriesController.php

    public function getHome($module = 0)
    {
        $cats = Category::where('module', $module)->orderBy('id', 'Desc')->get();
---
select * from `categories` where `module` = '0' and `categories`.`deleted_at` is null order by `id` desc

    public function postCategoryAdd(Request $request)
    {
        $rules = [
            'name' => 'required',
            'icon' => 'required'
        ];
        $messages = [
            'name.required' => 'Ingrese un nombre',
            'icon.required' => 'Ingrese el HTML del icono'
        ];
        $validator = Validator::make($request->all(), $rules, $messages);
        if ($validator->fails()) {
            return back()->withErrors($validator)->with('message', 'Se ha producido un error')->with('typealert', 'danger')->withInput();
        } else {
            $category = new Category();
            $category->name = e($request->input('name'));
            $category->module = $request->input('module');
            $category->slug = Str::slug($request->input('name'));
            $category->icon = e($request->input('icon'));
            if ($category->save()) {
---
insert into `categories` (`name`, `module`, `slug`, `icon`, `updated_at`, `created_at`) values ('Test', '0', 'test', 'a', '2022-04-06 22:33:28', '2022-04-06 22:33:28')

    public function getCategoryDelete($id){
        $category = Category::findOrFail($id);
        if ($category->delete()) {
---
select * from `categories` where `categories`.`id` = '1' and `categories`.`deleted_at` is null limit 1
update `categories` set `deleted_at` = '2022-04-06 22:29:57', `categories`.`updated_at` = '2022-04-06 22:29:57' where `id` = 1