app/Http/Controllers/Admin/ProductController.php

select * from `products` where `status` = '0' order by `id` desc limit 25 offset 0
select count(*) as aggregate from `products` where `status` = '0'
select * from `products` where `status` = '1' order by `id` desc limit 25 offset 0
select count(*) as aggregate from `products` where `status` = '1'
select * from `products` order by `id` desc limit 25 offset 0
select count(*) as aggregate from `products`
---
    public function getHome($status)
    {
        switch ($status) {
            case '0':
                $products = Product::with('getCategory')->where('status', '0')->orderBy('id', 'desc')->paginate(25);
                break;
            case '1':
                $products = Product::with('getCategory')->where('status', '1')->orderBy('id', 'desc')->paginate(25);
                break;
            case 'trash':
                $products = Product::with('getCategory')->onlyTrashed()->orderBy('id', 'desc')->paginate(25);
                break;
            case 'all':
                $products = Product::with('getCategory')->orderBy('id', 'desc')->paginate(25);

select `name`, `id` from `categories` where `module` = '0' and `categories`.`deleted_at` is null
---
    public function getProductAdd()
    {
        $cats = Category::where('module', '0')->pluck('name', 'id');

insert into `products` (`status`, `name`, `slug`, `category_id`, `file_path`, `image`, `price`, `quantity`, `sku`, `indiscount`, `discount`, `content`, `updated_at`, `created_at`) values ('0', 'Juego de lol', 'juego-de-lol', '2', '2022-04-06', '94-logo-upq.png', '12', '100', '2112331', '0', '0', '&lt;p&gt;juego de lol&lt;/p&gt;', '2022-04-06 22:34:53', '2022-04-06 22:34:53')
---
            $product->indiscount = $request->input('indiscount');
            $product->discount = $request->input('discount');
            $product->content = e($request->input('content'));
            if ($product->save()) {