app/Http/Controllers/Admin/UserController.php

select * from `users` order by `id` desc limit 25 offset 0
select count(*) as aggregate from `users`
---
    public function getUsers($status)
    {
        if ($status == 'all') {
            $users = User::orderby('id', 'Desc')->paginate(25);